tap "anomalyco/tap", "https://github.com/anomalyco/homebrew-tap.git", trusted: true
tap "bishalr0y/bishalr0y", trusted: true
tap "caarlos0/tap", trusted: true
tap "charmbracelet/tap", trusted: true
tap "derailed/k9s", trusted: true
tap "jesseduffield/lazygit", trusted: true
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Arbitrary precision numeric processing language
brew "bc"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# CLI to streamline Go project setup with standardized structure
brew "go-blueprint"
# Database migrations CLI tool
brew "golang-migrate"
# Go Language's command-line interface for database migrations
brew "goose"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Generate type safe Go from SQL
brew "sqlc"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Fast static site generator in a single binary with everything built-in
brew "zola"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Terminal process manager
brew "bishalr0y/bishalr0y/pman"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Application uninstaller
cask "appcleaner"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# App to write, plan, collaborate, and get organised
cask "notion"
# Replacement for Docker Desktop
cask "orbstack"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# REST, GraphQL and gRPC client
cask "yaak"
go "github.com/air-verse/air"
go "github.com/spf13/cobra-cli"
go "github.com/kisielk/errcheck"
go "github.com/bishalr0y/ghdl"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "olexsmir.xyz/json2go/cmd/json2go"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
cargo "rustlings"
npm "@plannotator/pi-extension"
npm "tree-sitter-cli"
npm "typescript"
