tap "caarlos0/tap"
tap "jesseduffield/lazygit"
tap "joshmedeski/sesh"
tap "sst/tap"
brew "bash"
brew "bc"
brew "coreutils"
brew "direnv"
brew "docker"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "gnu-sed"
brew "go"
brew "go-blueprint"
brew "golang-migrate"
brew "goose"
brew "jq"
brew "lazygit"
brew "minikube"
brew "neovim"
brew "nowplaying-cli"
brew "ripgrep"
brew "opencode"
brew "ossp-uuid"
brew "protobuf"
brew "rust"
brew "sqlc"
brew "stow"
brew "terminal-notifier"
brew "tilt"
brew "tmux"
brew "tree"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "caarlos0/tap/timer"
cask "appcleaner"
cask "brave-browser"
cask "discord"
cask "ghostty"
cask "localsend"
cask "notion"
cask "shottr"
cask "spotify"
cask "tableplus"
cask "yaak"
go "github.com/air-verse/air"
go "github.com/spf13/cobra-cli"
go "github.com/kisielk/errcheck"
go "github.com/bishalr0y/ghdl"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
cargo "sleek"
