tap "jesseduffield/lazygit"
tap "joshmedeski/sesh"
brew "bash"
brew "bc"
brew "coreutils"
brew "docker"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gawk"
brew "gemini-cli"
brew "gh"
brew "gnu-sed"
brew "go"
brew "go-blueprint"
brew "golang-migrate"
brew "gum"
brew "jq"
brew "lazygit"
brew "neovim"
brew "nowplaying-cli"
brew "nvm"
brew "ossp-uuid"
brew "ripgrep"
brew "rust"
brew "sqlc"
brew "stow"
brew "thefuck"
brew "tmux"
brew "tree"
brew "zoxide"
brew "joshmedeski/sesh/sesh"
cask "appcleaner"
cask "brave-browser"
cask "discord"
cask "ghostty"
cask "localsend"
cask "spotify"
cask "tableplus"
cask "yaak"
